<template>
  <div id="carouselDemo">
    <el-carousel indicator-position="outside" height="660px" autoplay>
      <el-carousel-item v-for="item in urls" :key="item">
        <img :src="item" alt />
      </el-carousel-item>
    </el-carousel>

    <p>
      五月，暮春。榴花正艳，月季如火，夕阳高照，春风轻撩，没有暑热，也没有春寒，走在公园的翠绿中，十分惬意！从公园的后门进来，四月的繁华已经褪去，便是那牡丹和芍药，也只是叶繁枝茂了，不经意的环顾，发现这里的布局有了变化，关于动物的设施增多了，左侧的栅栏里，有一头大象，正孤独地来回在栅栏内走动，栅栏里只它一个孤单的独居，大概没有同伴，它无以交流，便独自的散步，以驱赶孤独。时而会来一些小朋友，亲切的叫它，并扔一些零食，它也合作，便常常伸开长长的鼻子，以配合小朋友对它的欢喜。它似乎是有灵性的，大概和我们人类一样，有情感，有思想，只是没有语言，无以表达，只能用肢体的动作来回应。它本应在大自然中自由生存，然而，人类为了自己的私欲，把他圈养，使它失去自由。我不知道它是否有情绪？若有，若此，它是否会有抑郁症？这般的想着，我自己倒伤感起来，不忍再看到它的表情和笨拙的行动，对面，便是猴苑和鸟笼。
      这边的情景便令人愉悦，猴儿们轻灵的互相追逐，时而还会龇牙咧嘴以威胁对方，而对方并不恐惧，甚至会向它发出挑战，继而，两猴之间便会你追我赶，其结果是，你给我逮逮虱子，我给你挠挠痒痒，其乐融融。我一直有个疑问，既然我们的祖先是猿猴，总之是猴的家族，我们都直立行走了几千年了，怎么我们的祖先还有不直立行走的呢？
      鸟笼里更是热闹非凡，笼里的鸟是不同种类的鹦鹉，它们羽毛的颜色各异，体格大小也不同，只是叫起来声音一样的洪亮。有一只特别可爱的鹦鹉，本来正在打盹，看到我为它拍照，不仅不害怕，还扭动着笨拙的腰肢一步步走近我，真想抚摸它一下，只可惜隔着铁笼子，我们只有默默相视片刻，它继续打它的盹，我便继续前行。
      不远处，便是狼的别墅了。我赶到的时候，正看到一幕温馨的情景：一窝小狼在妈妈身边嬉戏着，而狼爸爸就在狼妈妈身边躺着，一副慈祥的面孔。似乎我的到来并没有打扰到它们，小狼们故我的玩闹着。看到这样的情景，我突然想到了初学课本上的名篇《狼》的故事来，想到《动物世界》里，凶残捕杀猎物的场景。这么温馨的场面，无论如何也无法把它们和龇牙咧嘴的凶残联系在一起，然而，凶残就是狼的本性，无论它怎样伪装。
      狼的隔壁是狮子，这样的安排真是天作之合，他们一等一的凶残。然而，那头雄狮却极其的安静，甚至不愿意转脸看我一眼，任我恣意的为它拍照，在我很努力的向它招呼下，它勉强正脸对着我的手机，我方拍到了它的真容。也许是圈养的缘故，让它失去了斗志；也许是它也在伪装，一旦有了时机，它一样会露出庐山真面目，一声狮吼，令大地颤栗。然而，那是它的生存手段，它不会弄虚作假，只有不遗余力的奔跑，追赶，撕咬，最后获取维系生命的食物。这是大自然的安排，大自然用极其高明的手段，形成一个庞大的生物链，好让生物链上的所有生命互相竞争，互相残食，最后，维系一种相对稳定的平衡。看来，竞争是自然界的潜规则，而人类也无法逃离竟争的宿命，只是人类有文明，才没显得那么残酷。生命不止，竞争不断……
      狮子的隔壁是老虎，老虎的凶残不亚于狼和狮子，它们三个为邻是最恰切不过的了，彼此都不会威胁到对方，也好让它们在相处之中彼此收敛，甚至，我觉得，它们有时也会有一些心灵上的交流，交流的内容一定是对人类的愤愤不平，它们一定觉得它们的世界应该在森林里、草原上或者深山里。也或许，它们已经没有了兽性，早已安于现状，毕竟，被圈养的最大好处是不必竞争，而且衣食无忧。
      这动物世界里的动物，也和人类一样，有老实的，有机灵的，有凶恶的，也有慈善的……你看那唐僧的坐骑，它就特别慈善，饲养它的人可以和它同处一处，也不会有任何担忧。大概是被驯养的缘故，它很乖，甚至能够听懂人类为它专设的口令，它还经常出现在文学作品中，比如：《三国演义》、《水浒传》、《西游记》以及《红楼梦》中。而且都是扮演的正面形象。它虽然有时也会任性，但更多的时候，它是驯服的。驯服自然有驯服的好处，它可以衣食无忧，不需要像狼、狮子和老虎一样去拼命的奔跑，追杀，撕咬。无论它的被驯服是心甘情愿还是无可奈何，总之，它们是人类最友好的朋友。因此，更是得到人类的爱戴。
      正当我乐在其中时，太阳悄悄地隐去，随着光线的暗淡，我也该回家了。我终于又找回童心，和这些动物们共度了一段美好时光！蓦然发现，动物世界也精彩！
    </p>
  </div>
</template>

<script>
export default {
  name: "HelloWorld",
  props: {
    msg: String
  },
  data() {
    return {
      name: "this is helloword!",
      urls: [
        "https://fuss10.elemecdn.com/a/3f/3302e58f9a181d2509f3dc0fa68b0jpeg.jpeg",
        "https://fuss10.elemecdn.com/1/34/19aa98b1fcb2781c4fba33d850549jpeg.jpeg",
        "https://fuss10.elemecdn.com/0/6f/e35ff375812e6b0020b6b4e8f9583jpeg.jpeg",
        "https://fuss10.elemecdn.com/9/bb/e27858e973f5d7d3904835f46abbdjpeg.jpeg",
        "https://fuss10.elemecdn.com/d/e6/c4d93a3805b3ce3f323f7974e6f78jpeg.jpeg",
        "https://fuss10.elemecdn.com/3/28/bbf893f792f03a54408b3b7a7ebf0jpeg.jpeg",
        "https://fuss10.elemecdn.com/2/11/6535bcfb26e4c79b48ddde44f4b6fjpeg.jpeg"
      ]
    };
  }
};
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">
#carouselDemo {
  width: 100%;
  height: 100%;
  overflow: auto;
  background: #fff;
  box-sizing: border-box;
  padding: 0px 0px 20px;
  img {
    width: 100%;
    transform: translateY(-30%);
  }
  p{
      font-size: 14px;
      text-indent: 20px;
      padding: 0px 10px;
  }
}
</style>
